{
    "primary_post": "There are moments in these deportation fights when I can just FEEL how pissed off they are that I’m Puerto Rican 😂 they want to threaten me with it so bad 😂",
    "comments": [
        "Alexandria Ocasio-Cortez",
        "There are moments in these deportation fights when I can just FEEL how pissed off they are that I’m Puerto Rican 😂 they want to threaten me with it so bad 😂",
        "Young lady...as an old white guy, you two are the reason I still have hope! Bless you and stay strong and safe💗",
        "Amazing powerful women-I am so here for this!",
        "Same from an old white woman",
        "\"But Daddy says I can have whatever I want!\"",
        "Keep fighting, Congresswoman Ocasio-Cortez! We need your voice. Be safe! Seriously. ✊🏽💙",
        "Couldnt agree more, Angele! 💙",
        "I love you.",
        "I love you both 💕",
        "I’m Puerto Rican and Mexican and I’m in constant fear. I was born in San Diego my parents are also born in America as were my grandparents. Before them I do not know. Yet I am constantly reminded that I could be next. When I see them target Navajos and green card holders.",
        "Stay strong. We have to do this together and I am one who, if I see anything happening in front of me, will get involved to help.",
        "It’s always a positive to know that people will say something. I just worry that people will become complacent. I currently live in Columbus Ga and I have a lot of maga people everywhere. It scares me. I try not to let it control my life. When all of this started I was scared to step outside.",
        "Georgia is a hard place to be right now I’m sure. I’m in Virginia which is more mixed but we have enough for sure.",
        "Yes all we can do is come together. Hopefully they see how wrong they are. Hopefully they’ll join hands with us. However when your heart is filled with hatred and bigotry all you see is a world full of enemies. You’d rather suffer so others can go without. They feel zero empathy very apathetic.",
        "congresswoman you stand tall and strong for your community and for the people that elected you in there you have been threatened yes but you wont back down we need everyone else to follow you and fight back against the evil nazi trump administration enough is enough get it done drag trump out now!!!",
        "We got your back AOC. #UNITEANDFIGHT",
        "That's cool and inspiring, but they also have military grade weapons, tanks and drones. People will die.",
        "People are dying anyway from their policies.",
        "True, and unlikely to change soon, I'm afraid. My point was that this image paints far too rosy a picture of the effectiveness of mass protest. The tech is different, and the response needs to be as well. More Hunger Games, less Tiananmen Square",
        "Stay safe wonderful leader…",
        "AOC please keep fighting millions of Americans are counting on you!",
        "Please check into what they are doing to green card holders right now and how they are being treated at airport ports of entry.",
        "What is happening? I remember last time they were looking through people's phones and social media.",
        "Wait what?????",
        "Yes. The TSA agents were looking through people's phones. I had to go to Europe to visit my Mum as she was sick and I deleted all my social media before I went.",
        "Do you know if they are doing the same to citizens traveling with green card holders?",
        "Give ‘em hell!",
        "Yep Puerto Rican as well. Keep the resistance going. You’re a brave young lady.",
        "You go, girl. By that I mean YOU STAY, GIRL.",
        "You have to be real truthful to yourself right now. This is happening! We are under attack. None of these maneuvers are to benefit Americans, which is the sole purpose for electing a president or leader.",
        "But we should remember this isn't silliness or inconsistency. It's racism. They know you're an American, they don't *want* you to be. Fascists want nothing more than to be able to selectively declare citizens \"illegal\".",
        "Please, Ms. Cortez, watch your back. They are not just pissed off, they itch to make an example of, what they would love to do to all people of colour... And you are - let's face it - a very big thorn in their paws 👍👍😘 And thank you for that from little Denmark 🇩🇰",
        "You KNOW they have said it to each other! 😂 There’s nothing more frightening to their big, fat, blubbery white selves than a woman who is easily poised to reveal how mid they really are….",
        "Puerto Rico is a beautiful island with wonderful people.",
        "You are also strong, smart, beautiful and courageous. Let them be pissed. We love everything about you",
        "God bless you and every Puerto Rican with their feet on the soil in the USA, many of whom have been here generations longer than my family. Many more happy years here y’all we love you and need you. 🌳🪺🌊",
        "Not only because you’re Puerto Rican, but even worse, you are a woman! Of color! And not obeying! Defying, challenging, and making a White guy look like the stupid, bigoted bully that he is!",
        "'Pissed' about your Puerto Rican roots. FEARFUL that you are a strong and super intelligent woman, that doesn't take shit.",
        "I love that for them. I’m sorry their racist turd energy is directed at you. It’s not easy to be on the right side of history, but watching you continue to fight is inspiring. 💙",
        "They are so damaged. Take solace in their pain, inferiority, and stupidity.",
        "And you're gorgeous and they know you think they're nasty!",
        "They are gd racists. Keep doing you.",
        "You just know they wana call you a slur lol",
        "Keep getting in to good trouble for us AOC! We love you for it!!!",
        "I'm not worried about them deporting you, I'm worried they'll do something much worse. Stay safe friend.",
        "You can’t deport Puerto Ricans, Puerto Ricans are Americans.",
        "And a good portion of this country will ve SHOCKED when they find out Puerto Ricans are actually American citizens.",
        "‪Someone‬ ‪@que.one‬",
        "The saddest part is that there are fellow Latinos that join them in their racist anger. Can't help recalling a comment Malcom X once made about those types of personalities. I know, this shouldn't be about race or ethnicity, it's about humanity 😩, and I hear you 🙏",
        "Create account"
    ],
    "timestamp": "2025-02-20T13:30:22.850291"
}